app/controllers/login_controller.rb

INSERT INTO "logins" ("email", "created_at", "updated_at") VALUES ($1, $2, $3)  [["email", "testauth@test.io"], ["created_at", "2022-01-19 16:54:31.122521"], ["updated_at", "2022-01-19 16:54:31.122521"]]
---
  def create
    unless login_params[:email]
      render json: { error: 'missing email' }, status: :bad_request
      return
    end

    unless login_params[:password]
      render json: { error: 'missing password' }, status: :bad_request
      return
    end

    token = User.authenticate(login_params)

    unless token
      render json: { error: 'failed to generate token' }, status: :unauthorized
      return
    end

    # Log the login for the user in the database
    Login.create({ email: login_params[:email] })