app/controllers/signup_controller.rb

INSERT INTO "tokens" ("token", "created_at", "updated_at") VALUES ($1, $2, $3)  [["token", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjpudWxsfQ.rT-L0meyqay1D1PkUKold4prXLIo-6iF9eDTBkpLc14"], ["created_at", "2022-01-19 03:25:08.702504"], ["updated_at", "2022-01-19 03:25:08.702504"]]
INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    unless signup_params[:email]
      render json: { error: 'missing email address' }, status: :bad_request
      return
    end

    unless signup_params[:password]
      render json: { error: 'missing password' }, status: :bad_request
      return
    end

    user_token = User.create_with_password(signup_params)