app/controllers/users_controller.rb

  def index
    unless Token.valid_token?(request.headers[Token.token_header_name])
      render json: { error: 'invalid token' }, status: :unauthorized
      return
    end
    render json: { users: User.all.map{ |user| { email: user['email'], firstName: user['first_name'], lastName: user['last_name'] } } }, status: :ok
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def update_user
    unless request.headers[Token.token_header_name] && Token.valid_token?(request.headers[Token.token_header_name])
      render json: { error: 'invalid token' }, status: :unauthorized
      return
    end

    token = Token.find_by_token(request.headers[Token.token_header_name])

    user_token = token.decode

    unless user_token[0] && user_token[0]['user_id']
      render json: { error: 'invalid token' }, status: :unauthorized
      return
    end

    user = User.find(user_token[0]['user_id'])
---
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."token" = $1 LIMIT $2  [["token", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjpudWxsfQ.rT-L0meyqay1D1PkUKold4prXLIo-6iF9eDTBkpLc14"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]